---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
source: html/abb42f97-928b-337f-26f7-ba939682c546.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData

Represents the electrical load area data.

## Syntax (C#)
```csharp
public class ElectricalLoadAreaData : SpatialElementDomainData
```